
&НаКлиенте
Процедура ОК(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("ВыполнятьВТранзакции", Объект.ВыполнятьВТранзакции); 
	Структура.Вставить("ВыполнятьВРежимеЗагрузки", Объект.ВыполнятьВРежимеЗагрузки);
	Структура.Вставить("НеПрерыватьВыполнениеПриОшибке", Объект.НеПрерыватьВыполнениеПриОшибке);
	
	ОповеститьОВыборе(Структура);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.ВыполнятьВРежимеЗагрузки = Параметры.ВыполнятьВРежимеЗагрузки;
	Объект.ВыполнятьВТранзакции = Параметры.ВыполнятьВТранзакции;
  	Объект.НеПрерыватьВыполнениеПриОшибке = Параметры.НеПрерыватьВыполнениеПриОшибке;

	Элементы.ПрерыватьВыполнениеПриОшибке.Видимость = Не Объект.ВыполнятьВТранзакции;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьВТранзакцииПриИзменении(Элемент)
	
	Элементы.ПрерыватьВыполнениеПриОшибке.Видимость = Не Объект.ВыполнятьВТранзакции;

КонецПроцедуры
