
&НаКлиенте
Процедура ПроверитьФормулу(Команда)
	
	НовоеЗначение = Неопределено;
	СтароеЗначение = СтароеЗначениеПример;
	
	Попытка
		Выполнить Формула;
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Если  НовоеЗначение = Неопределено Тогда
		
		Сообщить("НовоеЗначение должно быть обязательно явно указано!"); 
		
	Иначе 
		
		Сообщить("Результат:");
		Сообщить(НовоеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИЗакрыть(Команда)
	
	ОповеститьОВыборе(Формула);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Формула = Параметры.Формула;
	
	СтароеЗначениеПример = 100;
	  
	Информация = "Параметры: " + Символы.ПС 
	+ "СтароеЗначение: старое значение реквизита" + Символы.ПС 
	+ "НовоеЗначение: новое значение реквизита" + Символы.ПС 
	+ " Доступные символы:" + Символы.ПС 
	+ "0123456789 /*-+";
	
КонецПроцедуры
