
&НаКлиенте
Процедура ЗавершитьРедактированиеИЗакрыть(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		
		СтруктураРезультат = Новый Структура;
		ДополнительныеСвойства = Новый Структура;	
		
		Для Каждого ДопСвойство Из Объект.ДополнительныеСвойства Цикл
			
			ДополнительныеСвойства .Вставить(ДопСвойство.Ключ, ДопСвойство.Значение);
			
		КонецЦикла;
		
		СтруктураРезультат.Вставить("ДополнительныеСвойства", ДополнительныеСвойства);	
		
		ОповеститьОВыборе(СтруктураРезультат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДополнительныеСвойства") Тогда
		
		Для Каждого ДопСвойство Из Параметры.ДополнительныеСвойства Цикл
			
			НоваяСтрока = Объект.ДополнительныеСвойства.Добавить();
			НоваяСтрока.Ключ = ДопСвойство.Ключ;
			НоваяСтрока.Значение = ДопСвойство.Значение;
			
		КонецЦикла;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ДополнительныеСвойства = Новый Структура;
	
	Для Каждого ДопСвойство Из Объект.ДополнительныеСвойства Цикл
		
		Попытка 
			
			ДополнительныеСвойства .Вставить(ДопСвойство.Ключ, ДопСвойство.Значение);
			
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось установить дополительное свойство " + ДопСвойство.Ключ + " по причине " + ОписаниеОшибки();
			Сообщение.Поле  = "Объект.ДополнительныеСвойства[" + Формат(ДопСвойство.ПолучитьИдентификатор(), "ЧГ=0") +"].Ключ";
			Сообщение.Сообщить();
			Отказ = Истина;
			
		КонецПопытки;
		
	КонецЦикла;

КонецПроцедуры
