
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ТаблицаКолонок.Количество() > 0 Тогда
		
		Для Каждого Колонка Из Параметры.ТаблицаКолонок Цикл
			
			ТаблицаКолонок.Добавить(Колонка.Значение, Колонка.Представление, Колонка.Пометка);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ОповеститьОВыборе(ТаблицаКолонок);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьФлажки(Команда)
	
	УстановитьФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьФлажки(Команда)
	
	УстановитьФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Значение)
	
	Для Каждого ЭлементСписка Из ТаблицаКолонок Цикл
		
		ЭлементСписка.Пометка = Значение;
		
	КонецЦикла;

КонецПроцедуры
